#findall  търси върхи текста дадениq pattern и върни съвбаденията
# връша цял листг ako ima рупи ги връща като  tuples!!!!!!
# re.findall(pattern, text) върща цял лист от стрингове

#finditter
#връша обекъи и трябва да итерираме през всеки един от тях

# Използвайте findall, когато искате всички срещания на шаблон.  защото когато имаме групи ги връща като  tuples
# Използвайте finditer, когато искате да обходите всички срещания на шаблон.
# Използвайте match, когато искате да проверите дали шаблонът съвпада в началото на низа.




